### Node.js



> 윤재성의 Node.js 서버 프로그래밍 과정



#### 개요

- 구글 크롬 브라우저에서 JavaScript 코드를 처리하기 위한 엔진인 v8엔진을 사용하는 서버측 프로그램 개발을 위한 플랫폼
- 2009년 Ryan Dahl에 의해 만들어짐
- 빠르고 확장 가능한 네트워크 애플리케이션을 쉽게 구축할 수 있도록 개발됨
- 가볍고 효율적인 비동기식으로 이벤트를 처리하여 분산 처리가 가능함
- 한번 작성된 프로그램은 다양한 플랫폼에서 동작할 수 있도록 설계되어 있으며 현재 Windows, Linux, maxOs에서 실행이 가능함



#### 특징

- 비 동기식 이벤트 처리

- 빠른 속도

- 단일 쓰래드이지만 확장성이 뛰어남 

  → node.js는 단일 쓰래딩 방식을 사용함으로써 Apache Tomcat과 같은 기존의 서버를 보다 확장성이 용이하고 훨씬 많은 수의 클라이언트 요청을 처리할 수 있음.

- 버퍼링이 없음



#### 설치

[nodejs.org](https://nodejs.org/en/) 접속 후 OS에 맞는 LTS파일 다운로드



